Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: The Buffer object offers superior clarity and flexibility when dealing with binary data, structures, DllCall and similar.
ja: Bufferオブジェクトは、バイナリ・データ、構造体、DllCallなどを扱う際に、優れた明快さと柔軟性を提供する。

source: The Buffer-like object or memory address which will receive the data.
ja: データを受け取るBufferのようなオブジェクトまたはメモリアドレス。

source: The ByRef marker (&) indicates that the caller must pass a variable reference.
ja: ByRef マーカ（&）は、呼び出し側が変数参照を渡さなければならないことを示します。

source: The Click function is generally more flexible and easier to use.
ja: 一般的にクリック機能の方が自由度が高く、使い勝手が良いとされています。

source: The Click function is recommended over MouseClick because it is generally easier to use.
ja: 一般的に使いやすいので、MouseClickよりもClick関数を推奨します。

source: The ColN option may be used to update specific columns without affecting the others.
ja: ColNオプションは、他の列に影響を与えずに特定の列を更新するために使用することができます。

source: The Controller-To-Mouse script converts a controller into a mouse by remapping its buttons and axis control.
ja: Controller-To-Mouseスクリプトは、ボタンと軸制御を再マッピングすることで、コントローラをマウスに変換します。

source: The DateAdd function can add or subtract a quantity of days, hours, minutes, or seconds to a time-string that is in the YYYYMMDDHH24MISS format.
ja: DateAdd関数は、YYYYMMDDHH24MISS形式の時間文字列に、日、時間、分、秒の数量を追加または減算することができます。

source: The DebugVars script can be used to inspect and change the contents of variables and objects.
ja: DebugVarsスクリプトは、変数やオブジェクトの内容を検査したり変更したりするのに使用します。

source: The EndReason property returns one of the following strings:
ja: EndReason プロパティは、以下の文字列のいずれかを返します：

source: The Exit or ExitApp function was used (includes custom menu items).
ja: ExitまたはExitApp機能を使用した（カスタムメニュー項目も含む）。

source: The Format function can also be used for this purpose.
ja: また、フォーマット機能もこの目的に使用できます。

source: The GuiControl object of the current GUI control.
ja: 現在のGUI コントロールのGuiControl オブジェクト。

source: The Hotkey function can also be used to assign a function or function object to a hotkey.
ja: また、ホットキー機能を使って、機能や機能オブジェクトをホットキーに割り当てることができます。

source: The Hotstring function can also be used to assign a function or function object to a hotstring.
ja: また、Hotstring機能を使って、関数や関数オブジェクトをHotstringに割り当てることもできます。

source: The Hotstring function can be used to change hotstring options while the script is running.
ja: Hotstring関数は、スクリプトの実行中にHotstringのオプションを変更するために使用することができます。

source: The InputHook function is more flexible than hotstrings for certain purposes.
ja: InputHook関数は、特定の目的のためにホットストリングよりも柔軟性があります。

source: The KeyHistory feature shows how many timers exist and how many are currently enabled.
ja: KeyHistory機能は、タイマーの存在と現在有効なタイマーの数を表示します。

source: The Last Found Window can be set by #HotIf.
ja: Last Found Windowは、#HotIfで設定することができます。

source: The MaxParams and IsVariadic properties of the function objects are evaluated to determine whether the property may accept parameters.
ja: 関数オブジェクトのMaxParamsおよびIsVariadicプロパティが評価され、そのプロパティがパラメータを受け入れることができるかどうかが決定されます。

source: The OnExit callback function (if any) will always run when called for, regardless of the current thread's priority.
ja: OnExitコールバック関数（もしあれば）は、現在のスレッドの優先順位に関係なく、呼ばれれば常に実行される。

source: The OnExit callback function will always launch regardless of how many threads exist.
ja: OnExitコールバック関数は、スレッドがいくつ存在しても常に起動します。

source: The One True Brace (OTB) style may optionally be used around an Else.
ja: OTB（One True Brace）スタイルは、オプションでエルゼの周りに使用することができます。

source: The One True Brace (OTB) style may optionally be used to define functions.
ja: 機能定義にOne True Brace（OTB）スタイルをオプションで使用することができる。

source: The One True Brace (OTB) style may optionally be used with the Finally statement.
ja: OTB（One True Brace）スタイルは、オプションでfinally文を使用することができる。

source: The One True Brace (OTB) style may optionally be used with the Try statement.
ja: One True Brace（OTB）スタイルは、オプションでTryステートメントと一緒に使用することができます。

source: The One True Brace (OTB) style may optionally be used with the finally statement.
ja: OTB（One True Brace）スタイルは、オプションでfinally文を使用することができる。

source: The One True Brace (OTB) style may optionally be used.
ja: OTB（One True Brace）スタイルはオプションで使用することができます。

source: The Persistent function may be needed to keep the script running while it is listening for events.
ja: Persistent関数は、スクリプトがイベントをリッスンしている間、実行し続けるために必要な場合があります。

source: The SendInput and SendPlay methods are always ignored, regardless of this setting.
ja: SendInputおよびSendPlayメソッドは、この設定にかかわらず、常に無視されます。

source: The SendPlay mode is able to successfully generate mouse events in a broader variety of games than the other modes.
ja: SendPlayモードは、他のモードに比べ、より幅広いゲームにおいてマウスイベントを正常に発生させることができます。

source: The Start method must be called before input will be collected.
ja: Startメソッドは、入力が収集される前に呼び出される必要があります。

source: The Suspend function can temporarily disable all hotkeys except for ones you make exempt.
ja: サスペンド機能は、一時的に免除したもの以外のホットキーを無効にすることができます。

source: The Type function can be used to determine the type of a value.
ja: Type関数は、値の型を決定するために使用することができます。

source: The WM_NEXTDLGCTL message can be used to focus the control and apply these additional effects.
ja: WM_NEXTDLGCTLメッセージは、コントロールをフォーカスし、これらの追加効果を適用するために使用することができます。

source: The WS_CAPTION style must also be specified.
ja: WS_CAPTIONスタイルも指定しなければならない。

source: The WS_SYSMENU style must also be specified.
ja: WS_SYSMENUスタイルも指定しなければならない。

source: The ahk_id criterion can be combined with other criteria to test a window's title, class or other attributes:
ja: ahk_id基準は、ウィンドウのタイトル、クラス、その他の属性をテストするために、他の基準と組み合わせることができます：

source: The attributes of the file currently retrieved.
ja: 現在検索しているファイルの属性。

source: The block below the if statement is executed only if WinWait finds a matching window.
ja: if文の下のブロックは、WinWaitが一致するウィンドウを見つけた場合のみ実行されます。

source: The body of a control flow statement is always a single group of statements.
ja: 制御フロー文の本体は、常に1つの文のグループです。

source: The current HotIf setting determines the variant of a hotkey upon which the Hotkey function will operate.
ja: 現在のHotIf設定は、Hotkey機能が動作するホットキーのバリアントを決定します。

source: The current HotIf setting determines the variant of a hotstring upon which the Hotstring function will operate.
ja: 現在のHotIf設定は、Hotstring機能が動作するホットストリングのバリアントを決定します。

source: The ending character that was pressed by the user to trigger the most recent non-auto-replace hotstring.
ja: 直近の非自動置換ホットストリングをトリガーするためにユーザーが押した終了文字。

source: The gigantic table on the Send page shows pretty much every special key built-in to AHK.
ja: センドページの巨大な表には、AHKに内蔵されている特殊キーのほとんどが示されている。

source: The image list will not be deleted when the control is destroyed.
ja: コントロールが破棄されても、画像リストは削除されない。

source: The initial working directory is used as A_ScriptDir and to locate the local Lib folder.
ja: 初期作業ディレクトリは、A_ScriptDirとして使用され、ローカルのLibフォルダを見つけるために使用される。

source: The keyboard hook is automatically used by any script that contains hotstrings.
ja: キーボードフックは、ホットストリングを含むすべてのスクリプトで自動的に使用されます。

source: The keyboard hook is required while an Input is in progress, but will be uninstalled automatically if it is no longer needed when the Input is terminated.
ja: キーボードフックは、入力中は必要ですが、入力終了時に不要になれば自動的にアンインストールされます。

source: The keyboard and/or mouse hooks will be installed or removed if justified by the changes made by this function.
ja: キーボードや マウスのフックは、本機能による変更で正当化される場合、取り付けまたは取り外しが可能です。

source: The language code.
ja: 言語コード。

source: The launcher can also be configured to run v1 scripts, v2 scripts or both with UI Access by default, but this option has no effect if a UIA.exe file does not exist for the selected version and build.
ja: ランチャーは、v1スクリプト、v2スクリプト、またはその両方をUIアクセスで実行するよう設定することもできますが、選択したバージョンとビルドのUIA.exeファイルが存在しない場合、このオプションは機能しません。

source: The main methods are SendInput, SendEvent and SendPlay.
ja: 主なメソッドは、SendInput、SendEvent、SendPlayです。

source: The maybe operator (var?) can be used to pass or omit a variable depending on whether it has a value.
ja: maybe演算子(var?)は、変数が値を持つかどうかによって、その変数を渡したり省略したりするのに使われます。

source: The mouse hook may be installed or removed if justified by the changes made by this function.
ja: 本機能による変更で正当化される場合は、マウスフックの取り付け、取り外しが可能です。

source: The notes for OnEvent regarding this and bound functions also apply to OnCommand.
ja: OnEventの注意事項である、thisとバインドされた関数に関する注意事項は、OnCommandにも適用されます。

source: The notes for OnEvent regarding this and bound functions also apply to OnNotify.
ja: OnEventの注意事項である、thisとバインドされた関数に関する注意事項は、OnNotifyにも適用されました。

source: The or-maybe operator (??) can be used to provide a default value when a variable lacks a value.
ja: 変数に値がない場合、or-maybe演算子(??)を使ってデフォルト値を提供することができる。

source: The priority of OnMessage threads is always 0.
ja: OnMessageスレッドの優先順位は常に0です。

source: The reference operator (&) allows a variable to be handled like a value.
ja: 参照演算子（&）により、変数を値のように扱うことができます。

source: The soundcard analysis script may help determine which name and/or number to use.
ja: サウンドカード解析スクリプトは、使用する名前や番号を決定するのに役立つかもしれません。

source: The standard modifier keys and CapsLock, NumLock and ScrollLock are always visible (not blocked).
ja: 標準の修飾キーとCapsLock、NumLock、ScrollLockは常に表示されます（ブロックされません）。

source: The statements to execute if a value or error is thrown.
ja: 値またはエラーがスローされた場合に実行する文です。

source: The string "ahk_pid " is concatenated with the process ID contained by the notepad_pid variable by simply writing them in sequence, separated by whitespace.
ja: 文字列「ahk_pid」は、変数notepad_pidが含むプロセスIDと、空白で区切って順番に書くだけで連結されます。

source: The study option (S) can sometimes improve the performance of a regular expression that is used many times (such as in a loop).
ja: 学習オプション（S）は、（ループ内などで）何度も使用される正規表現のパフォーマンスを向上させることができる場合があります。

source: The ternary conditional operator (?:) also short-circuits by not evaluating the losing branch.
ja: 三項条件演算子（?:）も、ロス分岐を評価しないことで短絡させる。

source: The ternary operator is also a good candidate:
ja: 三項演算子も良い候補である：

source: The tray icon changes to (or to if the script is also suspended), whenever the script's current thread is in a paused state.
ja: スクリプトの現在のスレッドが一時停止状態にあるとき、トレイアイコンはに変わります。（またはスクリプトがsuspendedされたときはに変わります）。

source: The use hook ($) prefix can be added to existing hotkeys.
ja: 既存のホットキーにユースフック（$）プレフィックスを追加することができます。

source: The vscode-autohotkey-debug extension enables Visual Studio Code to act as a debugger client for AutoHotkey.
ja: vscode-autohotkey-debug拡張機能により、Visual Studio Codeが AutoHotkey のデバッガークライアントとして動作するようになります。

source: The *RunAs verb may be used in place of the Run as administrator right-click menu item.
ja: 管理者として実行右クリックメニューの代わりに*RunAs動詞を使用することができます。

source: The Col option may be used to update specific columns without affecting the others.
ja: Colオプションは、他の列に影響を与えずに特定の列を更新するために使用することができます。

source: The EndKey property contains the terminating key name or character without braces.
ja: EndKeyプロパティには、中括弧のない終端キー名または文字が格納されます。

source: The HRESULT return type was used and the function returned an error value (as defined by the FAILED macro).
ja: HRESULT戻り値が使用され、関数がエラー値（FAILED マクロで定義）を返しました。

source: The Match property contains the matched item.
ja: Matchプロパティには、一致した項目が含まれます。

source: The asterisk suffix is also supported.
ja: 接尾辞のアスタリスクにも対応しています。

source: The current thread is made critical, meaning that it cannot be interrupted by another thread.
ja: 現在のスレッドは、他のスレッドによって中断されないことを意味するクリティカルにされます。

source: The function object to call when the property is assigned a value.
ja: プロパティに値が割り当てられたときに呼び出される関数オブジェクトです。

source: The function object to call when the property is called.
ja: プロパティが呼び出されたときに呼び出される関数オブジェクトです。

source: The function object to call when the property's value is retrieved.
ja: プロパティの値が取得されたときに呼び出される関数オブジェクトです。

source: The or-maybe operator (??) can be used to avoid that case by providing a default value.
ja: or-maybe演算子（??）は、デフォルト値を提供することで、そのようなケースを避けるために使うことができる。

source: The priority of the hotstring (e.g. P1).
ja: ホットストリングの優先順位（例：P1）。

source: The return type or one of the specified arg types is invalid.
ja: 戻り値の型、または指定されたargの型のいずれかが無効です。

source: The thread displaying a message box can typically be interrupted, allowing the new thread to display its own message box before the previous call returns.
ja: メッセージボックスを表示しているスレッドは、通常、中断することができ、前の呼び出しが戻る前に新しいスレッドが独自のメッセージボックスを表示することができます。

source: The AddStandard method adds the standard menu items and allows them to be individually modified as with custom items.
ja: AddStandardメソッドは、標準的なメニュー項目を追加し、カスタム項目と同様に個別に変更することができます。

source: The default encoding is ignored and the data contained by the object is written as-is, regardless of Options.
ja: デフォルトのエンコーディングは無視され、Optionsに関係なく、オブジェクトが含むデータはそのまま書き込まれます。

source: The keyboard hook will be used to implement all keyboard hotkeys between here and the next #UseHook False (if any).
ja: キーボードフックは、ここから次に現れる#UseHook Falseまでの間、すべてのキーボードホットキーを実装するために使われます。

source: The keyboard hook will be used to implement all keyboard hotkeys between here and the next #UseHook false (if any).
ja: キーボードフックは、ここから次の#UseHook falseまでの間のすべてのキーボードホットキーを実装するために使用されます（存在する場合）。

source: The WS_CAPTION and WS_POPUPWINDOW styles must be combined to make the window menu visible.
ja: ウィンドウメニューを表示するには、WS_CAPTIONとWS_POPUPWINDOWのスタイルを組み合わせる必要があります。

source: The Capacity property was added.
ja: Capacityプロパティを追加しました。

source: The * (deref) operator has been removed.
ja: *(deref)演算子は削除されました。

source: The +HwndVarName option has been removed in favour of GuiControl.Hwnd.
ja: GuiControl.Hwndの代わりに、+HwndVarNameオプションが削除されました。

source: The , and % options have been removed, since there is no longer any need to escape these characters.
ja: これらの文字をエスケープする必要がなくなったため、,と% のオプションは削除されました。

source: The C option now also accepts a suffix equivalent to the CaseSense parameter of other functions (in addition to CL):
ja: Cオプションで、他の関数（CL以外）のCaseSenseパラメータと同等の接尾辞を受け付けるようになりました：

source: The C option now also accepts a suffix equivalent to the CaseSense parameter of other functions (in addition to CL): CLocale CLogical COn C1 COff C0.
ja: Cオプションで、他の関数（CL以外）のCaseSenseパラメータと同等の接尾辞を受け付けるようになりました：CLocale CLogical COn C1 COff C0。

source: The Closure class extends Func but does not define any new properties.
ja: ClosureクラスはFuncを拡張していますが、新しいプロパティは定義していません。

source: The UseErrorLevel modes of the Run and Hotkey functions were removed.
ja: Run関数とHotkey関数のUseErrorLevelモードが削除されました。

source: The \\?\ long path prefix is used (caveats apply).
ja: \\?\ ロングパスプリフィックスを使用します（注意事項あり）。

source: The global keyword is currently redundant when used in global scope, but can be used for clarity.
ja: globalキーワードは、現在、グローバルスコープで使用すると冗長になりますが、明確にするために使用することができます。

source: The new operator has been removed.
ja: newオペレーターは削除されました。

source: The unset keyword can also be used in a function definition to indicate that a parameter is optional but has no default value.
ja: unsetキーワードは、関数定義において、パラメータがオプションであり、デフォルト値がないことを示すために使用することもできます。

source: The vName option now just sets the control's name to Name.
ja: vNameオプションは、コントロールの名前をNameに設定するだけになりました。

source: The ~ (bitwise-NOT) operator now always treats its input as a 64-bit signed integer; it no longer treats values between 0 and 4294967295 as unsigned 32-bit.
ja: ~（bitwise-NOT）演算子は、常に入力を64ビットの符号付き整数として扱うようになりました。0から4294967295までの値を符号なし32ビットとして扱わなくなりました。

source: The 0x prefix is not included unless the # flag is used, as in {:#x}.
ja: 0xは {:#x}のように#フラグが使用されていない限り、接頭辞は含まれない。

source: The e format is used only when the exponent of the value is less than -4 or greater than or equal to the precision argument.
ja: e形式は，値の指数が-4未満，または精度引数以上の場合にのみ使用されます。

source: The |n or ||n mode is not supported (use ControlChooseIndex instead, if needed).
ja: |nまたは||nモードには対応していません（必要であれば、代わりにControlChooseIndexを使用してください）。

source: The |n or ||n mode is not supported (use ControlChooseString instead, if needed).
ja: |nまたは||nモードには対応していません（必要であれば、代わりにControlChooseStringを使用してください）。

source: The |n or ||n mode is not supported (use ControlChoose instead, if needed).
ja: |nまたは||nモードには対応していません（必要であれば、代わりに ControlChoose を使用してください）。

source: The |n or ||n mode is not supported.
ja: |nまたは||nモードには対応していません。

source: The throw does not need to be physically contained by the Catch statement's body; it can be used by a called function.
ja: throwは Catch文の本体に物理的に含まれる必要はなく、呼び出された関数が使用することができます。

source: The -RAW suffix can be omitted, but in that case any newly created files will have a byte order mark.
ja: RAWサフィックスは省略可能ですが、その場合、新しく作成されるファイルにはバイトオーダーマークが付きます。

source: The throw does not need to be physically contained by the catch statement's body; it can be used by a called function.
ja: throwは catch文の本体に物理的に含まれる必要はなく、呼び出された関数が使用することができます。

source: The C and ? options may be included in String or set as defaults by the #Hotstring directive or a previous call to this function.
ja: Cと ?のオプションは、Stringに含まれるか、#Hotstringディレクティブまたはこの関数の以前の呼び出しによって、デフォルトとして設定されるかもしれません。

source: The Control Parameter
ja: 制御パラメータ

source: The EndKeys list uses a format similar to the Send function.
ja: EndKeysリストは、Send関数と同様の形式を使用します。

source: The FileName parameter may optionally be preceded by *i and a single space, which causes the program to ignore any failure to read the included file.
ja: FileNameパラメータの前には、オプションで*iとスペース1個を付けることができます。この場合、含まれるファイルの読み込みに失敗しても、プログラムは無視します。

source: The FileName parameter may optionally begin with *i and a single space, which causes the program to ignore any failure to load the file.
ja: FileNameパラメータは、オプションで*iと1つのスペースで始まることができ、これによりプログラムはファイルの読み込みに失敗しても無視することができます。

source: The KeyName parameter is not suitable for use with the AltTab or ShiftAltTab actions.
ja: KeyNameパラメータは、AltTabまたはShiftAltTabアクションでの使用には適していません。

source: The KeyName parameter specifies one or more keys that are either not recognized or not supported by the current keyboard layout/language.
ja: KeyNameパラメータは、現在のキーボードレイアウト/言語で認識されていない、またはサポートされていない1つまたは複数のキーを指定します。

source: The Options parameter accepts a string of zero or more case-insensitive options delimited by a space or tab, similar to Gui control options.
ja: Optionsパラメータは、Guiのコントロールオプションと同様に、スペースまたはタブで区切られた0個以上の大文字と小文字を区別しないオプションの文字列を受け付けます。

source: The Options parameter can be either a combination (sum) of numeric values from the following groups, which is passed directly to the operating system's MessageBox function, or a string of zero or more case-insensitive options separated by at least one space or tab.
ja: Optionsパラメータには、以下のグループからの数値の組み合わせ（合計）をオペレーティングシステムのMessageBox関数に直接渡すか、0個以上の大文字小文字を区別しないオプションを少なくとも1つのスペースまたはタブで区切った文字列を指定することができます。

source: The ProgramFiles(x86) environment variable contains the path of the 32-bit Program Files directory.
ja: ProgramFiles(x86)環境変数には、32ビットProgram Filesディレクトリのパスが含まれる。

source: The ShortcutKey of a newly created shortcut will have no effect unless the shortcut file resides on the desktop or somewhere in the Start Menu.
ja: 新しく作成したショートカットのShortcutKeyは、ショートカットファイルがデスクトップまたはスタートメニューのどこかに存在しない限り、何の効果もありません。

source: The SubFunction, Value1, and Value2 parameters are dependent upon each other and their usage is described below.
ja: SubFunction、Value1、Value2の各パラメータは互いに依存しており、その使い方は後述する。

source: The Try statement is usually followed by a block (one or more statements enclosed in braces).
ja: 通常、Tryステートメントの後には 1 つのブロック（中括弧で囲まれた 1 つ以上のステートメント）が続きます。

source: The Try statement is usually followed by a block - one or more statements (typically functions or expressions) enclosed in braces.
ja: 通常、Try文の後にはブロック（中括弧で囲まれた1つ以上の文（通常は関数や式））が続く。

source: The Value of a wrapper object can be retrieved using ComObjValue.
ja: ラッパーオブジェクトの値は、ComObjValueを使用して取得することができます。

source: The VarName parameter has been split into separate input/output parameters, for flexibility.
ja: VarNameパラメータは、柔軟性を持たせるために、入出力パラメータに分割されました。

source: The VarType of a wrapper object can be retrieved using ComObjType.
ja: ラッパーオブジェクトのVarTypeはComObjTypeで取得することができます。

source: The WinTitle parameter of various functions can now accept a HWND (must be a pure integer) or an object with a Hwnd property, such as a Gui object.
ja: 各種関数のWinTitleパラメータに、HWND（純粋な整数でなければならない）またはGuiオブジェクトのようなHwndプロパティを持つオブジェクトを受け取ることができるようになりました。

source: The body of a control flow statement is the statement or group of statements to which it applies.
ja: 制御フロー文の本体は、それが適用される文または文のグループです。

source: The current thread is defined as the flow of execution invoked by the most recent event; examples include hotkeys, SetTimer subroutines, custom menu items, and GUI events.
ja: 現在のスレッドは、最新のイベントによって呼び出された実行フローとして定義されます。例としては、ホットキー、SetTimerサブルーチン、カスタムメニュー項目、GUIイベントなどがあります。

source: The current thread sets its own priority via the Thread function.
ja: 現在のスレッドは、スレッド関数を介して自身の優先順位を設定する。

source: The object is AutoHotkey's composite or abstract data type.
ja: オブジェクトは、AutoHotkeyの複合データ型または抽象データ型です。

source: The speed parameter or SetDefaultMouseSpeed can be used to reduce the speed (in the default SendEvent mode only).
ja: speedパラメータまたはSetDefaultMouseSpeedを使用すると、速度を下げることができます（デフォルトのSendEventモードのみ）。

source: The value of the object.
ja: オブジェクトの値です。

source: The Control parameter can be one of the following:
ja: Controlパラメータには、以下のいずれかを指定します：

source: The Speed parameter or SetDefaultMouseSpeed can be used to reduce the speed (in SendEvent mode only).
ja: SpeedパラメータやSetDefaultMouseSpeed関数で、マウススピードを落とすことができます（SendEvent mode のみ）。

source: The Text property retrieves or sets the caption/display text of the following control types:
ja: Textプロパティは、以下のコントロールタイプのキャプション/表示テキストを取得または設定します：

source: The Text property retrieves or sets the currently selected item/tab for the following control types:
ja: Textプロパティは、以下のコントロールタイプにおいて、現在選択されている項目/タブを取得または設定します：

source: The [DllFile\]Function parameter is a floating point number.
ja: [DllFile\]Functionパラメータは、浮動小数点数です。

source: The lParam parameter of this message contains a pointer to a structure containing information about the notification.
ja: このメッセージのlParamパラメータは、通知に関する情報を含む構造体へのポインタを含みます。

source: The Address parameter can be an object with the Ptr and Size properties, such as the new Buffer object.
ja: Addressパラメータには、新しいBufferオブジェクトのようなPtrと Sizeプロパティを持つオブジェクトを指定することができます。

source: The Text property retrieves or sets the text of the first part only (use SB.SetText for greater flexibility).
ja: Textプロパティは、最初の部分のテキストのみを取得または設定します（より柔軟に対応するためにはSB.SetTextを使用してください）。

source: The Text property retrieves the formatted text displayed by the control.
ja: Textプロパティは、コントロールが表示する書式付きテキストを取得します。

source: The code field contains the notification code.
ja: コードフィールドには、通知コードが入ります。

source: The length of a string is the number of characters in the sequence, while the position of a character in the string is merely that character's sequential number.
ja: 文字列の長さは、その文字列の文字数であり、文字列中のある文字の位置は、その文字の連番でしかありません。

source: The Extra property of the error object contains the PCRE error number.
ja: エラーオブジェクトのExtraプロパティには、PCREのエラー番号が記載されています。

source: The current thread can be executing functions within its own subroutine or within other subroutines called by that subroutine.
ja: 現在のスレッドは、自身のサブルーチン内で関数を実行することも、そのサブルーチンから呼び出された他のサブルーチン内で関数を実行することもできる。

source: The Seconds parameter no long exists (it had no effect on Windows Vista or later).
ja: Secondsパラメータは、もはや存在しません（Windows Vista以降では効果がありませんでした）。

source: The Timeout parameter no long exists (it had no effect on Windows Vista or later).
ja: Timeoutパラメータは、もはや存在しません（Windows Vista以降では効果がありませんでした）。

source: The == and !== operators can be used to compare strings which contain binary zero.
ja: ==と!==演算子は、2進数の0を含む文字列を比較するのに使うことができる。

source: The == operator behaves identically to = except when either of the inputs is not numeric (or both are strings), in which case == is always case-sensitive and = is always case-insensitive.
ja: ==演算子は、=演算子と同じ動作をするが、入力のどちらかが数値でない（あるいは両方が文字列である）場合は、==は常に大文字と小文字を区別し、=は常に大文字と小文字を区別しない。

source: The != and !== behave identically to their counterparts without !, except that the result is inverted.
ja: !=と!==は、結果が反転することを除けば、!を使わない場合と同じ動作をする。
